#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```

aws_acm_certificate.app_certificate[0]: Refreshing state... [id=arn:aws:acm:eu-west-1:437707960179:certificate/e0e4e822-eea2-4442-b66b-cdc5c540be7c]
aws_acm_certificate.app_certificate[0] (deposed object 988b0b44): Refreshing state... [id=arn:aws:acm:eu-west-1:437707960179:certificate/6a69afd8-51d7-4c1e-a967-1f61519492a3]
aws_cloudfront_origin_access_control.app_oac: Refreshing state... [id=E2D87NNSQM3OC1]
data.aws_route53_zone.main_domain[0]: Reading...
aws_cloudfront_origin_request_policy.app_request_policy: Refreshing state... [id=a8acaa09-2576-413e-98f4-1c964889d90b]
aws_cloudfront_cache_policy.app_cache_policy: Refreshing state... [id=1c0867cb-23b8-4b74-8b85-cfe4245cb927]
aws_s3_bucket.app_bucket: Refreshing state... [id=dev-nextjs-formation-app-bucket]
data.aws_route53_zone.main_domain[0]: Read complete after 0s [id=Z0901806342JE97O6SZMG]
aws_route53_record.cert_validation["dev-nextjs.stansk.com"]: Refreshing state... [id=Z0901806342JE97O6SZMG__ff51aa8190939b9276286b50e23a6709.dev-nextjs.stansk.com._CNAME]
aws_acm_certificate_validation.cert_validation[0]: Refreshing state... [id=2025-03-31 14:32:30.204 +0000 UTC]
aws_s3_bucket_versioning.app_bucket_versioning: Refreshing state... [id=dev-nextjs-formation-app-bucket]
aws_s3_bucket_website_configuration.app_website: Refreshing state... [id=dev-nextjs-formation-app-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_acm_certificate.app_certificate[0] has been deleted
  - resource "aws_acm_certificate" "app_certificate" {
      - arn                       = "arn:aws:acm:eu-west-1:437707960179:certificate/e0e4e822-eea2-4442-b66b-cdc5c540be7c" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "dev-nextjs.stansk.com"
              - resource_record_name  = "_ff51aa8190939b9276286b50e23a6709.dev-nextjs.stansk.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_5f80042ffe1b3a975c19c94fec60647c.xlfgrmvvlj.acm-validations.aws."
            },
        ] -> null
        id                        = "arn:aws:acm:eu-west-1:437707960179:certificate/e0e4e822-eea2-4442-b66b-cdc5c540be7c"
        tags                      = {
            "Environment" = "dev"
            "Name"        = "dev-nextjs-formation-certificate"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.cert_validation[0] has been deleted
  - resource "aws_acm_certificate_validation" "cert_validation" {
      - certificate_arn         = "arn:aws:acm:eu-west-1:437707960179:certificate/e0e4e822-eea2-4442-b66b-cdc5c540be7c" -> null
        id                      = "2025-03-31 14:32:30.204 +0000 UTC"
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.app_certificate[0] will be created
  + resource "aws_acm_certificate" "app_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "dev-nextjs.stansk.com"
      + domain_validation_options = [
          + {
              + domain_name           = "dev-nextjs.stansk.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dev-nextjs.stansk.com",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "dev-nextjs-formation-certificate"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-nextjs-formation-certificate"
          + "Project"     = "nextjs-formation"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert_validation[0] will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.app_distribution will be created
  + resource "aws_cloudfront_distribution" "app_distribution" {
      + aliases                         = [
          + "dev-nextjs.stansk.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "dev nextjs-formation Distribution"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "dev-nextjs-formation-distribution"
        }
      + tags_all                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-nextjs-formation-distribution"
          + "Project"     = "nextjs-formation"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id          = "1c0867cb-23b8-4b74-8b85-cfe4245cb927"
          + cached_methods           = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "a8acaa09-2576-413e-98f4-1c964889d90b"
          + target_origin_id         = "S3-dev-nextjs-formation"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "dev-nextjs-formation-app-bucket.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = "E2D87NNSQM3OC1"
          + origin_id                = "S3-dev-nextjs-formation"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.app_domain[0] will be created
  + resource "aws_route53_record" "app_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev-nextjs.stansk.com"
      + type            = "A"
      + zone_id         = "Z0901806342JE97O6SZMG"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.cert_validation["dev-nextjs.stansk.com"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_ff51aa8190939b9276286b50e23a6709.dev-nextjs.stansk.com" -> (known after apply)
      ~ id                               = "Z0901806342JE97O6SZMG__ff51aa8190939b9276286b50e23a6709.dev-nextjs.stansk.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_ff51aa8190939b9276286b50e23a6709.dev-nextjs.stansk.com" # forces replacement -> (known after apply) # forces replacement
      ~ records                          = [
          - "_5f80042ffe1b3a975c19c94fec60647c.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.app_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "app_bucket_policy" {
      + bucket = "dev-nextjs-formation-app-bucket"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_website_configuration.app_website is tainted, so must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "app_website" {
      ~ id               = "dev-nextjs-formation-app-bucket" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-eu-west-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "dev-nextjs-formation-app-bucket.s3-website-eu-west-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + cloudfront_distribution_id = (known after apply)
  + cloudfront_domain_name     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
